nxp-mcuxpresso/mcux-component/power_manager/devices/KW45B41Z83/fsl_pm_device.c
            for (uint32_t i = 2UL; i < 12UL; i++)
            {
                g_wakeupEntry[i] = i;
            }
            /* Set wake up address. */
            SPC_SetWakeUpValue(SPC0, (uint32_t)g_wakeupEntry);

            /* Don't spend time for crc calculation if crc value is already done, fields are unchanged */
            if (crcResult == 0UL)
            {
                crc_config_t config;
                config.polynomial         = 0x04C11DB7U;
                config.seed               = 0xFFFFFFFFU;
                config.reflectIn          = false;
                config.reflectOut         = false;
                config.complementChecksum = false;
                config.crcBits            = kCrcBits32;
                config.crcResult          = kCrcFinalChecksum;

                /* Need to disable clock before CRC_init() to prevent hardfault when going to lowpower */
                CLOCK_DisableClock(kCLOCK_Crc0);
                CRC_Init(CRC0, &config);
                CRC_WriteData(CRC0, (const uint8_t *)((uint32_t)g_wakeupEntry), 48);
                crcResult = CRC_Get32bitResult(CRC0);
            }
            REGFILE1->REG[0] = crcResult;

            PM_DEV_SaveRuntimeContext();

#if (defined(FSL_PM_SUPPORT_LP_TIMER_CONTROLLER) && FSL_PM_SUPPORT_LP_TIMER_CONTROLLER)
            PM_RecordAndStartTimer();
#endif /* FSL_PM_SUPPORT_LP_TIMER_CONTROLLER */

            /*
             * $Branch Coverage Justification$
             * $ref pm_device_c_ref_2$.
             */
            if (setjmp(g_coreContext) == 0) /* GCOVR_EXCL_BR_LINE */
            {
                CMC_EnterLowPowerMode(CMC0, &g_mainWakePDConfig);
            }

#if (defined(FSL_PM_SUPPORT_LP_TIMER_CONTROLLER) && FSL_PM_SUPPORT_LP_TIMER_CONTROLLER)
            PM_StopAndRecordTimer();
#endif /* FSL_PM_SUPPORT_LP_TIMER_CONTROLLER */

            PM_DEV_RestoreRuntimeContext();
        }
    }
    /* Note: Reconfigure CMC and clear SCR SLEEPDEEP bit to
     * avoid soc low power when a WFI instruction is called. */
    CMC_SetClockMode(CMC0, kCMC_GateNoneClock);
    CMC_SetMAINPowerMode(CMC0, kCMC_ActiveMode);
    CMC_SetWAKEPowerMode(CMC0, kCMC_ActiveMode);
    SCB->SCR &= ~SCB_SCR_SLEEPDEEP_Msk;
    __DSB();
}

static void PM_DEV_CleanExitLowPowerMode(void)
{
    if ((SPC_CheckPowerDomainLowPowerRequest(SPC0, kSPC_PowerDomain0) == true) && /* GCOVR_EXCL_BR_LINE */
        (SPC_GetPowerDomainLowPowerMode(SPC0, kSPC_PowerDomain0) >= kSPC_PowerDownWithSysClockOff)) /* GCOVR_EXCL_LINE */
    {
        /*
         * $Line Coverage Justification$
         * $ref pm_device_c_ref_2$.
         */
        /* We need to release IO isolation when exiting from Power Down mode
         * This is done here after all peripherals have been reinitialized, to
         * avoid any glitch on IOs */
        SPC_ClearPeriphIOIsolationFlag(SPC0); /* GCOVR_EXCL_LINE */
    }

    /* Clear SPC LP request status for next low power phase
     * The clean up API has been added because the modules registered to notification
     * could need to read some status registers (like the following one for PM_DEV)
     * so we don't want a specific module to handle the clear of those status
     * as it could lead to some modules missing the status information
     * (depending on the notification order).
     * So this API is meant to clear everything needed for the platform once
     * every module got notified. */
    SPC_ClearPowerDomainLowPowerRequestFlag(SPC0, kSPC_PowerDomain0);
    SPC_ClearPowerDomainLowPowerRequestFlag(SPC0, kSPC_PowerDomain1);
    SPC_ClearPowerDomainLowPowerRequestFlag(SPC0, kSPC_PowerDomain2);
}

static uint8_t PM_DEV_FindOperateMode(uint32_t rescIndex, pm_resc_group_t *pSysRescGroup)
{
    assert(pSysRescGroup);
    uint32_t u32Tmp = (pSysRescGroup->groupSlice[rescIndex / 8UL] >> (4UL * (rescIndex % 8UL))) & 0xFUL;

    u32Tmp |= (u32Tmp >> 1UL);
    u32Tmp |= (u32Tmp >> 2UL);

    return (uint8_t)(((u32Tmp + 1UL) >> 1UL));
}

static void PM_DEV_EnableBasicResources(pm_resc_mask_t *pSoftRescMask, pm_resc_group_t *pSysRescGroup)
{
    assert(pSoftRescMask);
    assert(pSysRescGroup);

    uint32_t i     = 0UL;
    uint8_t opMode = PM_RESOURCE_OFF;

    for (i = 0UL; i < PM_RESOURCE_DB_COUNT; i++)
    {
        if ((pSoftRescMask->rescMask[i / 32UL] & (1UL << (i % 32UL))) != 0UL)
        {
            opMode = PM_DEV_FindOperateMode(i, pSysRescGroup);
            resourceDB[i].resourceConfigFunc(opMode, &resourceDB[i]);
        }
    }
}

static void PM_DEV_SetRAMOperateMode(uint8_t operateMode, pm_dev_resource_recode_t *pResourceRecode)
{
    assert(pResourceRecode);

    uint8_t tmp8;
    uint8_t sramId;

    tmp8 = pResourceRecode->defaultOperateMode;
    /*
     * $Branch Coverage Justification$
     * $ref pm_device_c_ref_4$.
     */
    if (operateMode != tmp8) /* GCOVR_EXCL_BR_LINE */
    {
        tmp8 = operateMode;
    }

    /* INT31-C: Validate pointer difference before narrowing conversion */
    ptrdiff_t diff = pResourceRecode - resourceDB;
    assert(diff >= 0 && diff <= UINT8_MAX);
    sramId = (uint8_t)diff;

    switch (tmp8) /* GCOVR_EXCL_BR_LINE */
    {
        case PM_RESOURCE_FULL_ON:
        {
            CMC_PowerOnSRAMAllMode(CMC0, 1UL << (uint32_t)sramId);
            CMC_PowerOnSRAMLowPowerOnly(CMC0, 1UL << (uint32_t)sramId);
            break;
        }

        case PM_RESOURCE_PARTABLE_ON1:
        {
            CMC_PowerOnSRAMAllMode(CMC0, 1UL << (uint32_t)sramId);
            CMC_PowerOffSRAMLowPowerOnly(CMC0, 1UL << (uint32_t)sramId);
            break;
        }

        /*
         * $Line Coverage Justification$
         * $ref pm_device_c_ref_3$.
         */
        /* GCOVR_EXCL_START */
        case PM_RESOURCE_OFF:
        {
            CMC_PowerOnSRAMLowPowerOnly(CMC0, 1UL << (uint32_t)sramId);
            CMC_PowerOffSRAMAllMode(CMC0, 1UL << (uint32_t)sramId);
            break;
        }

        /*
         * $Line Coverage Justification$
         * $ref pm_device_c_ref_1$.
         */
        default:
        {
            /* This branch will never be hit. */
            break;
            /* GCOVR_EXCL_STOP */
        }
    }
    pResourceRecode->currentOperateMode = tmp8;
}

static void PM_DEV_SetFro192MOperateMode(uint8_t operateMode, pm_dev_resource_recode_t *pResourceRecode)
{
    assert(pResourceRecode);

