nxp-mcuxpresso/mcux-component/power_manager/devices/KW45B41Z83/fsl_pm_device.c
    uint8_t tmp8;

    tmp8 = pResourceRecode->defaultOperateMode;

    /*
     * $Branch Coverage Justification$
     * $ref pm_device_c_ref_4$.
     */
    if (operateMode != tmp8) /* GCOVR_EXCL_BR_LINE */
    {
        tmp8 = operateMode;
    }

    /*
     * $Branch Coverage Justification$
     * $ref pm_device_c_ref_4$.
     */
    if (tmp8 == PM_RESOURCE_FULL_ON) /* GCOVR_EXCL_BR_LINE */
    {
        SCG0->FIRCCSR |= SCG_FIRCCSR_FIRCSTEN_MASK;
    }
    else
    {
        /*
         * $Line Coverage Justification$
         * $ref pm_device_c_ref_4$.
         */
        SCG0->FIRCCSR &= ~SCG_FIRCCSR_FIRCSTEN_MASK; /* GCOVR_EXCL_LINE */
    }

    pResourceRecode->currentOperateMode = tmp8;
}

/*
 * $Function Coverage Justification$
 * $ref pm_device_c_ref_4$. PM_DEV_SetFro6MOperateMode is the FRO_6M (SIRC) resource operate-mode
 * setter; it is only invoked when an FRO_6M operate-mode constraint is applied. The functional
 * unit test does not set an FRO_6M constraint, so this resource config function is not exercised.
 */
/* GCOVR_EXCL_START */
static void PM_DEV_SetFro6MOperateMode(uint8_t operateMode, pm_dev_resource_recode_t *pResourceRecode)
{
    assert(pResourceRecode);

    uint8_t tmp8;

    tmp8 = pResourceRecode->defaultOperateMode;

    if (operateMode != tmp8)
    {
        tmp8 = operateMode;
    }

    if (tmp8 == PM_RESOURCE_FULL_ON)
    {
        SCG0->SIRCCSR |= SCG_SIRCCSR_SIRCSTEN_MASK;
    }
    else
    {
        SCG0->SIRCCSR &= ~SCG_SIRCCSR_SIRCSTEN_MASK;
    }

    pResourceRecode->currentOperateMode = tmp8;
}
/* GCOVR_EXCL_STOP */

static void PM_DEV_SetWakePowerDomainOperateMode(uint8_t operateMode, pm_dev_resource_recode_t *pResourceRecode)
{
    if (operateMode == PM_RESOURCE_FULL_ON)
    {
        g_mainWakePDConfig.wake_domain = kCMC_ActiveMode;
    }
    else if (operateMode == PM_RESOURCE_PARTABLE_ON2)
    {
        /*
         * $Branch Coverage Justification$
         * $ref pm_device_c_ref_4$.
         */
        if (g_mainWakePDConfig.main_domain >= kCMC_SleepMode) /* GCOVR_EXCL_BR_LINE */
        {
            g_mainWakePDConfig.wake_domain = kCMC_SleepMode;
        }
    }
    /*
     * $Branch Coverage Justification$
     * PM_DEV does not provided the software method to power off WAKE power domain.
     */
    else if (operateMode == PM_RESOURCE_PARTABLE_ON1) /* GCOVR_EXCL_BR_LINE */
    {
        if (g_mainWakePDConfig.main_domain >= kCMC_DeepSleepMode)
        {
            g_mainWakePDConfig.wake_domain = kCMC_DeepSleepMode;
        }
    }
    else
    {
        /* MISRA C-2012 rule 15.7 */
    }

    pResourceRecode->currentOperateMode = operateMode;
}

static void PM_DEV_WakeupFunction(void) /* GCOVR_EXCL_FUNCTION */
{
    uint32_t sp;

    /*
     * $Line Coverage Justification$
     * $ref pm_device_c_ref_2$
     */
    WDOG0->CS    = (uint32_t)((WDOG0->CS) & ~WDOG_CS_EN_MASK);
    WDOG0->TOVAL = 0xFFFF;
#if ((__FPU_PRESENT == 1) && (__FPU_USED == 1))
    SCB->CPACR |= ((3UL << 10 * 2) | (3UL << 11 * 2));    /* set CP10, CP11 Full Access in Secure mode */
#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
    SCB_NS->CPACR |= ((3UL << 10 * 2) | (3UL << 11 * 2)); /* set CP10, CP11 Full Access in Non-secure mode */
#endif                                                    /* (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */
#endif                                                    /* ((__FPU_PRESENT == 1) && (__FPU_USED == 1)) */

    /* Initialize PSP to MSP before switching over to the process stack */
    sp = __get_MSP();
    __set_PSP(sp);
    __DSB();
    __ISB();
    /* Restore the CONTROL register. */
    __set_CONTROL(g_cpuControl);
    longjmp(g_coreContext, (int32_t) true);
}

static void PM_DEV_SaveRuntimeContext(void)
{
    uint32_t i = 0UL;

    primask_mask = __get_PRIMASK();
    basepri_mask = __get_BASEPRI();

    g_scbVtor  = SCB->VTOR;
    g_scbIcsr  = SCB->ICSR;
    g_scbAircr = ((SCB->AIRCR) & ~SCB_AIRCR_VECTKEY_Msk) | (0x5FAUL << (uint32_t)SCB_AIRCR_VECTKEY_Pos);
    g_scbCCR   = SCB->CCR;
    for (i = 0UL; i < 12UL; i++)
    {
        g_scbShp[i] = SCB->SHPR[i];
    }
    g_scbShcsr = SCB->SHCSR;
    for (i = 0UL; i < 16U; i++)
    {
        g_nvicIser[i] = NVIC->ISER[i];
    }
    for (i = 0UL; i < 496UL; i++)
    {
        g_nvicIp[i] = NVIC->IPR[i];
    }
    g_cpuControl  = __get_CONTROL();
    g_systickCtrl = SysTick->CTRL;
    g_systickLoad = SysTick->LOAD;
}

static void PM_DEV_RestoreRuntimeContext(void)
{
    uint32_t i;

    __set_PRIMASK(primask_mask);
    __set_BASEPRI(basepri_mask);
    __DSB();
    __ISB();

    SCB->VTOR  = g_scbVtor;
    SCB->ICSR  = g_scbIcsr;
    SCB->AIRCR = g_scbAircr;
    SCB->CCR   = g_scbCCR;
    for (i = 0UL; i < 12UL; i++)
    {
        SCB->SHPR[i] = g_scbShp[i];
    }
    SCB->SHCSR = g_scbShcsr;
    for (i = 0UL; i < 16UL; i++)
    {
        NVIC->ISER[i] = g_nvicIser[i];
    }
    for (i = 0UL; i < 496UL; i++)
    {
        NVIC->IPR[i] = g_nvicIp[i];
    }
    SysTick->CTRL = g_systickCtrl;
    SysTick->LOAD = g_systickLoad;
}

#if (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER)
static status_t PM_DEV_ManageWakeupSource(pm_wakeup_source_t *ws, bool enable)
{
    assert(ws);

    uint32_t inputType;
    uint32_t inputId;
    uint32_t irqn;
    uint32_t misc;

    PM_DECODE_WAKEUP_SOURCE_ID(ws->wsId);

    if (inputType == 0UL)
    {
        /* Wakeup source is external pin. */
        wuu_external_wakeup_pin_config_t pinConfig;

        pinConfig.edge  = enable ? (wuu_external_pin_edge_detection_t)misc : kWUU_ExternalPinDisable;
        pinConfig.event = kWUU_ExternalPinInterrupt;
        pinConfig.mode  = kWUU_ExternalPinActiveDSPD;

        WUU_SetExternalWakeUpPinsConfig(WUU0, (uint8_t)inputId, &pinConfig);

        if (enable)
        {
            (void)EnableIRQ((IRQn_Type)irqn);
            (void)EnableIRQ(WUU0_IRQn);
        }
        else
        {
            (void)DisableIRQ((IRQn_Type)irqn);
            /*
             * $Branch Coverage Justification$
             * $ref pm_device_c_ref_4$.
             */
            if ((WUU0->PE1 == 0UL) && (WUU0->PE2 == 0UL)) /* GCOVR_EXCL_BR_LINE */
            {
                (void)DisableIRQ(WUU0_IRQn);
            }
        }
    }
    else
    {
        if (enable)
        {
            /* Wakeup source is internal module. */
            (void)EnableIRQ(WUU0_IRQn);
            WUU_SetInternalWakeUpModulesConfig(WUU0, (uint8_t)inputId, kWUU_InternalModuleInterrupt);
            /* INT31-C: Validate IRQ number before enum conversion */
            assert(irqn <= 255U);
            (void)EnableIRQ((IRQn_Type)irqn);
        }
        else
        {
            WUU0->ME &= ~(1UL << inputId);
            /* INT31-C: Validate IRQ number before enum conversion */
            assert(irqn <= 255U);
            (void)DisableIRQ((IRQn_Type)irqn);
            (void)DisableIRQ(WUU0_IRQn);
        }
    }

    return kStatus_Success;
}

static bool PM_DEV_IsWakeupSource(pm_wakeup_source_t *ws)
{
    uint32_t inputType;
    uint32_t inputId;
    uint32_t irqn;
    uint32_t misc;
    uint32_t wuuPf;
    uint32_t mask;
    bool ret = false;

    assert(ws != NULL);

    PM_DECODE_WAKEUP_SOURCE_ID(ws->wsId);

    /* Wakeup source is external pin. */
    /*
     * $Branch Coverage Justification$
     * $ref pm_device_c_ref_4$.
     */
    if (inputType == 0UL) /* GCOVR_EXCL_BR_LINE */
    {
        wuuPf = WUU_GetExternalWakeUpPinsFlag(WUU0);
        mask  = (1UL << inputId) & WUU_PIN_FLAG_MASK;

        if ((wuuPf & mask) != 0UL) /* GCOVR_EXCL_BR_LINE */
        {
            /*
             * $Line Coverage Justification$
             * $ref pm_device_c_ref_2$.
             */
            /* This wake up source triggered the last wake up */
            ret = true; /* GCOVR_EXCL_LINE */
        }
    }

    (void)irqn;
    (void)misc;

    return ret;
}
#endif /* FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER */
